[{"title":"Airtel 5G Plus is now live in 8 cities: Airtel","imageUrl":"https://newsapi-sagar.herokuapp.com/images/image1.jpg","description":"Airtel has launched Airtel 5G Plus in 8 cities like Delhi, Mumbai, Chennai and more in a phased manner. The network offers 30X higher speed and works on 5G-enabled devices and handsets with existing Airtel SIMs, it revealed. Airtel 5G Plus also runs on the most widely accepted technology in the world with the most developed ecosystem.","date":"2022-10-15"},{"title":"India defeat Sri Lanka to win Women's Asia Cup for a record-extending 7th time","imageUrl":"https://newsapi-sagar.herokuapp.com/images/image1.jpg","description":"India defeated Sri Lanka by eight wickets in the final in Sylhet to win Women's Asia Cup for a record-extending seventh time. Bowling first after losing the toss, India restricted Sri Lanka to 65/9. India chased down the target in 8.3 overs. India's seven Women's Asia Cup victories include four in ODI format and three in T20I format.","date":"2022-10-15"},{"title":"Brightest-ever gamma ray burst spotted, NASA shares pic of its afterglow","imageUrl":"https://newsapi-sagar.herokuapp.com/images/image1.jpg","description":"Astronomers spotted the brightest-ever gamma ray burst (GRB) that occurred 2.4 billion light years from Earth. It was likely triggered by a supernova explosion giving birth to a black hole and the burst lasted for more than 10 hours. NASA shared a picture of the afterglow captured by Swift's X-Ray Telescope about an hour after the GRB was first detected","date":"2022-10-15"},{"title":"Musk says he's 'obviously overpaying' for Twitter but 'excited' for $44 bn deal","imageUrl":"https://newsapi-sagar.herokuapp.com/images/image1.jpg","description":"The world's richest person Elon Musk on Wednesday said that while he was \"obviously overpaying\" to acquire Twitter for $44 billion, he was \"excited\" to own the social media site. He added, \"Though myself and the other investors are obviously overpaying for Twitter right now, the long-term potential for Twitter is an order of magnitude greater than its current value.\"","date":"2022-10-15"},{"title":"Police officer accidentally shoots mobile shop worker in Punjab, video goes viral","imageUrl":"https://newsapi-sagar.herokuapp.com/images/image1.jpg","description":"A youth working in a mobile shop in Punjab's Amritsar got injured in an alleged accidental firing by a policeman. \"The accused police official has been suspended. We've recovered the CCTV footage,\" said Varinder Singh, ACP North, Amritsar. He further said that necessary action will be taken as per the statements of the eyewitnesses and the family.","date":"2022-10-15"},{"title":"Bank worker, wife cheat ex-Lok Sabha official of over ₹1 cr on pretext of investments","imageUrl":"https://newsapi-sagar.herokuapp.com/images/image1.jpg","description":"A retired deputy director of security at the Lok Sabha was allegedly cheated of over ₹1 crore by an Axis Bank employee and his wife on the pretext of investments in mutual funds and shares. The 83-year-old retired official knew the accused since 2013 and the latter had been sharing fake documents of investments with him.","date":"2022-10-15"}]